Revit 2024 API
ParameterUtils Class
 A utility class of functions related to parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static class ParameterUtils
Visual Basic
Public NotInheritable Class ParameterUtils
Visual C++
public ref class ParameterUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterUtils
See Also
ParameterUtils Members
Autodesk.Revit.DB Namespace